Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
screen_input (InputLayer)       [(None, 5, 16, 16)]  0                                            
__________________________________________________________________________________________________
minimap_input (InputLayer)      [(None, 4, 16, 16)]  0                                            
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 1, 16, 16),  0           screen_input[0][0]               
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 1, 16, 16),  0           minimap_input[0][0]              
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 16, 16)]     0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding (Embedding)           (None, 16, 16, 10)   50          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 16, 16, 10)   20          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding_2 (Embedding)         (None, 16, 16, 10)   40          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 1, 16, 16)]  0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 1, 16, 16)]  0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding_3 (Embedding)         (None, 16, 16, 10)   50          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding_4 (Embedding)         (None, 16, 16, 10)   20          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding_5 (Embedding)         (None, 16, 16, 10)   40          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
embedding_6 (Embedding)         (None, 16, 16, 10)   20          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding_1[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding_2[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 1, 16, 16)]  0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 1, 16, 16)]  0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding_3[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding_4[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding_5[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 10, 16, 16)] 0           embedding_6[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 32, 16, 16)] 0           tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 40, 16, 16)] 0           tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
                                                                 tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 16, 16, 16)   12816       tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 16, 16, 16)   16016       tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 16, 16)   4640        conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 16, 16)   4640        conv2d_2[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None, 64, 16, 16)] 0           conv2d_1[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
state_flat (Flatten)            (None, 16384)        0           tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
dense (Dense)                   (None, 256)          4194560     state_flat[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 25)           6425        dense[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1, 16, 16)    65          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 16, 16)    65          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 16, 16)    65          tf_op_layer_ScoutingForNexus_a2c/
__________________________________________________________________________________________________
value_out (Dense)               (None, 1)            257         dense[0][0]                      
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 25)]         0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 11)]         0                                            
__________________________________________________________________________________________________
mask_unavailable_action_ids (La (None, 25)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 256)          0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 256)          0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 256)          0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            514         dense[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 5)            1285        dense[0][0]                      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 10)           2570        dense[0][0]                      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 2)            514         dense[0][0]                      
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 4)            1028        dense[0][0]                      
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 4)            1028        dense[0][0]                      
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 4)            1028        dense[0][0]                      
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 10)           2570        dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_ScoutingForNexus_a2 [(None,)]            0           value_out[0][0]                  
==================================================================================================
Total params: 4,250,326
Trainable params: 4,250,326
Non-trainable params: 0
__________________________________________________________________________________________________
